# Aula 5 - Manipulação de dados

Prof. Tiago Dias

[Linkedin](https://www.linkedin.com/in/diasctiago/) | [Github](https://github.com/diasctiago) | [Blog](https://www.dadosaocubo.com/)

Editado por: Mayra Souza Costa

## Conhecendo o pandas

[Documentação pandas](https://pandas.pydata.org/docs/user_guide/index.html)

### O que é um DataFrame?

DataFrame, é a representação de uma tabela na biblioteca pandas.

| ![DataFrame](https://pandas.pydata.org/docs/_images/01_table_dataframe.svg) |
|:--:| 
| _DataFrame_ (Fonte da imagem: [Pandas](https://pandas.pydata.org/)) |

### O que é uma Series?

Uma Series, é a representação de cada coluna de uma tabela individual.

| ![Series](https://pandas.pydata.org/docs/_images/01_table_series.svg) |
|:--:| 
| _Series_ (Fonte da imagem: [Pandas](https://pandas.pydata.org/)) |

### Que tipos de dados posso trabalhar no pandas?

É possível ler e gravar dados e diversas fontes com o pandas.

| ![Tipos de Dados](https://pandas.pydata.org/docs/_images/02_io_readwrite.svg) |
|:--:| 
| _Tipos de Dados_ (Fonte da imagem: [Pandas](https://pandas.pydata.org/)) |

### Prática com Pandas

In [2]:
# importando a biblioteca
import pandas as pd

#### Concat

In [3]:
# juntando duas séries
s1 = pd.Series(['a','b'])
s2 = pd.Series(['c','d'])

In [4]:
s1

0    a
1    b
dtype: object

In [5]:
s2

0    c
1    d
dtype: object

In [6]:
# preservando os indices
pd.concat([s1,s2])

0    a
1    b
0    c
1    d
dtype: object

In [7]:
# ignorando os indices
pd.concat([s1,s2], ignore_index=True)

0    a
1    b
2    c
3    d
dtype: object

In [8]:
# juntando dois dataframes
df1 = pd.DataFrame([['a', 1], ['b', 2]],
                   columns=['letra','numero'])
df2 = pd.DataFrame([['c', 3], ['d', 4]],
                   columns=['letra','numero'])

In [9]:
df1

  letra  numero
0     a       1
1     b       2

In [10]:
df2

  letra  numero
0     c       3
1     d       4

In [11]:
# dataframes com mesmas colunas
pd.concat([df1,df2])

  letra  numero
0     a       1
1     b       2
0     c       3
1     d       4

In [12]:
# juntando dois dataframes
df3 = pd.DataFrame([['e', 5, 'elefante'],
                    ['f', 6, 'foca']],
                   columns=['letra','numero','animal'])

In [13]:
df3

  letra  numero    animal
0     e       5  elefante
1     f       6      foca

In [14]:
# dataframes com colunas dferentes
pd.concat([df1,df3])

  letra  numero    animal
0     a       1       NaN
1     b       2       NaN
0     e       5  elefante
1     f       6      foca

In [15]:
pd.concat([df1,df3]).isnull().sum()

letra     0
numero    0
animal    2
dtype: int64

In [16]:
# juntando os três e resetando o index
pd.concat([df1,df2,df3], ignore_index=True)

  letra  numero    animal
0     a       1       NaN
1     b       2       NaN
2     c       3       NaN
3     d       4       NaN
4     e       5  elefante
5     f       6      foca

#### Merge

In [17]:
# unindo dois dataframes
df_animal1 = pd.DataFrame([['gato', 4],
                           ['cachorro', 4],
                           ['pato', 2]],
                          columns=['animal','patas'])
df_animal2 = pd.DataFrame([['gato', 'mamífero'],
                           ['cachorro', 'mamífero'],
                           ['pato', 'ave']],
                          columns=['animal', 'tipo'])

In [ ]:
df_animal1

     animal  patas
0      gato      4
1  cachorro      4
2      pato      2

In [18]:
df_animal2

     animal      tipo
0      gato  mamífero
1  cachorro  mamífero
2      pato       ave

In [19]:
# especificando as colunas da união
df_animal1.merge(df_animal2, left_on='animal', right_on='animal')

     animal  patas      tipo
0      gato      4  mamífero
1  cachorro      4  mamífero
2      pato      2       ave

In [20]:
# unindo os dados com chave semelhante
df_animal1.merge(df_animal2, on='animal', how='inner')

     animal  patas      tipo
0      gato      4  mamífero
1  cachorro      4  mamífero
2      pato      2       ave

In [21]:
# adicionando mais uma linha na tabela 1
df_animal3 = pd.DataFrame([['cavalo', 4],
                           ['ganso', 2]],
                          columns=['animal', 'patas'])

In [22]:
df_animal3

   animal  patas
0  cavalo      4
1   ganso      2

In [23]:
# juntando os novos dados 
df_animal1 = pd.concat([df_animal1,df_animal3], ignore_index=True)

In [ ]:
df_animal1

     animal  patas
0      gato      4
1  cachorro      4
2      pato      2
3    cavalo      4
4     ganso      2

In [ ]:
df_animal2

     animal      tipo
0      gato  mamífero
1  cachorro  mamífero
2      pato       ave

In [24]:
# unindo os dados com chave semelhante
df_animal1.merge(df_animal2, on='animal', how='inner')

     animal  patas      tipo
0      gato      4  mamífero
1  cachorro      4  mamífero
2      pato      2       ave

In [25]:
# unindo os dados com chave semelhante, modificando a forma da união
df_animal1.merge(df_animal2, on='animal', how='left')

     animal  patas      tipo
0      gato      4  mamífero
1  cachorro      4  mamífero
2      pato      2       ave
3    cavalo      4       NaN
4     ganso      2       NaN

In [26]:
df_animal2.merge(df_animal1, on='animal', how='right')

     animal      tipo  patas
0      gato  mamífero      4
1  cachorro  mamífero      4
2      pato       ave      2
3    cavalo       NaN      4
4     ganso       NaN      2

#### Join

In [27]:
# usando a função join
df_animal1.join(df_animal2, how='left', lsuffix='_l', rsuffix='_r')

   animal_l  patas  animal_r      tipo
0      gato      4      gato  mamífero
1  cachorro      4  cachorro  mamífero
2      pato      2      pato       ave
3    cavalo      4       NaN       NaN
4     ganso      2       NaN       NaN

In [28]:
# usando a função join e apontando o index
df_animal1.set_index('animal').join(df_animal2.set_index('animal'), how='left')

          patas      tipo
animal
gato          4  mamífero
cachorro      4  mamífero
pato          2       ave
cavalo        4       NaN
ganso         2       NaN

#### Pivot

In [29]:
# alterando a exibição de linhas para colunas
df_letra_numero = pd.DataFrame({'abc': ['abc','abc','abc','abc','abc','abc'],
                                'letra': ['a','b','c','d','e','f'],
                                'numero': [1,2,3,4,5,6]})

In [30]:
# exibindo dataframe
df_letra_numero

   abc letra  numero
0  abc     a       1
1  abc     b       2
2  abc     c       3
3  abc     d       4
4  abc     e       5
5  abc     f       6

In [31]:
# transformando linhas em colunas
df_letra_numero.pivot(index='abc',columns='letra',values='numero')

letra  a  b  c  d  e  f
abc
abc    1  2  3  4  5  6

In [32]:
# alterando a exibição de linhas para colunas
df_vendas = pd.DataFrame({'mes':['01-jan','02-fev','02-fev','04-abr','04-abr','05-mai'],
                          'produto': ['celular','celular','notebook','notebook','mouse','celular'],
                          'quantidade': [10,25,32,13,5,16]})

In [33]:
# exibindo dataframe
df_vendas

      mes   produto  quantidade
0  01-jan   celular          10
1  02-fev   celular          25
2  02-fev  notebook          32
3  04-abr  notebook          13
4  04-abr     mouse           5
5  05-mai   celular          16

In [34]:
# transformando linhas em colunas
df_vendas.pivot(index='produto',columns='mes',values='quantidade')

mes       01-jan  02-fev  04-abr  05-mai
produto
celular     10.0    25.0     NaN    16.0
mouse        NaN     NaN     5.0     NaN
notebook     NaN    32.0    13.0     NaN

In [35]:
df_vendas.pivot(index='produto',columns='mes',values='quantidade')[['01-jan','02-fev']]

mes       01-jan  02-fev
produto
celular     10.0    25.0
mouse        NaN     NaN
notebook     NaN    32.0

In [36]:
df_vendas_pivot = df_vendas.pivot(index='produto',columns='mes',values='quantidade')

In [37]:
df_vendas_pivot.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, celular to notebook
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   01-jan  1 non-null      float64
 1   02-fev  2 non-null      float64
 2   04-abr  2 non-null      float64
 3   05-mai  1 non-null      float64
dtypes: float64(4)
memory usage: 120.0+ bytes

In [38]:
df_vendas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   mes         6 non-null      object
 1   produto     6 non-null      object
 2   quantidade  6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

#### Melt

In [39]:
# alterando a exibição de colunas para linhas
df_temperatura = pd.DataFrame([[20,21,25,26,22,19],
                               [29,31,34,37,25,22]],
                              columns=['jan','fev','mar','abr','jun','jul'],
                              index=['min','max'])

In [40]:
# exibindo dataframe
df_temperatura

     jan  fev  mar  abr  jun  jul
min   20   21   25   26   22   19
max   29   31   34   37   25   22

In [ ]:
# transformando colunas em linhas
df_temperatura.melt(value_vars=['jan','fev','mar','abr','jun','jul'], ignore_index=False)

    variable  value
min      jan     20
max      jan     29
min      fev     21
max      fev     31
min      mar     25
max      mar     34
min      abr     26
max      abr     37
min      jun     22
max      jun     25
min      jul     19
max      jul     22

In [41]:
# transformando colunas em linhas, incluindo index
df_temperatura.melt(value_vars=['jan','fev','mar','abr','jun','jul'], ignore_index=False).reset_index()

   index variable  value
0    min      jan     20
1    max      jan     29
2    min      fev     21
3    max      fev     31
4    min      mar     25
5    max      mar     34
6    min      abr     26
7    max      abr     37
8    min      jun     22
9    max      jun     25
10   min      jul     19
11   max      jul     22

In [ ]:
# transformando colunas em linhas, ajustando colunas do dataframe
df_temperatura\
  .melt(value_vars=['jan','fev','mar','abr','jun','jul'], ignore_index=False)\
  .reset_index()\
  .rename(columns={'index':'var', 'variable': 'mes', 'value': 'temperatura'})

    var  mes  temperatura
0   min  jan           20
1   max  jan           29
2   min  fev           21
3   max  fev           31
4   min  mar           25
5   max  mar           34
6   min  abr           26
7   max  abr           37
8   min  jun           22
9   max  jun           25
10  min  jul           19
11  max  jul           22

### Estudo de Caso

Com um conjunto de dados, como incluir uma nova observação, realizar merge com outra tabela contendo informações extras a respeito dessa observação?
*   https://www.kaggle.com/datasets/sveta151/tiktok-popular-songs-2022
*   https://www.kaggle.com/datasets/sveta151/tiktok-popular-songs-2021

In [6]:
tt21 = pd.read_csv('TikTok_songs_2021.csv')
tt21.head()

,track_name,artist_name,artist_pop,album,track_pop,danceability,energy,loudness,mode,key,speechiness,acousticness,instrumentalness,liveness,valence,tempo,time_signature,duration_ms
0,STAY (with Justin Bieber),The Kid LAROI,83,STAY (with Justin Bieber),89,0.591,0.764,-5.484,1,1,0.0483,0.0383,0.000000,0.1030,0.478,169.928,4,141806
1,Peaches (feat. Daniel Caesar & Giveon),Justin Bieber,90,Justice,86,0.677,0.696,-6.181,1,0,0.1190,0.3210,0.000000,0.4200,0.464,90.030,4,198082
2,edamame (feat. Rich Brian),bbno$,72,edamame (feat. Rich Brian),77,0.815,0.848,-4.704,0,4,0.1150,0.0230,0.000162,0.0265,0.684,106.032,4,133707
3,Here's Your Perfect,Jamie Miller,65,Here's Your Perfect,77,0.558,0.454,-5.335,1,6,0.0551,0.4990,0.000000,0.1460,0.424,113.120,4,158594
4,It's You,Sezairi,57,It's You,73,0.630,0.456,-8.285,1,8,0.0317,0.5450,0.000000,0.1140,0.166,137.915,3,251440

In [7]:
tt21.shape

(190, 18)

In [8]:
tt22 = pd.read_csv('TikTok_songs_2022.csv')
tt22.head()

,track_name,artist_name,artist_pop,album,track_pop,danceability,energy,loudness,mode,key,speechiness,acousticness,instrumentalness,liveness,valence,tempo,time_signature,duration_ms
0,Running Up That Hill (A Deal With God),Kate Bush,81,Hounds Of Love,95,0.629,0.547,-13.123,0,10,0.0550,0.7200,0.003140,0.0604,0.197,108.375,4,298933
1,As It Was,Harry Styles,91,As It Was,96,0.520,0.731,-5.338,0,6,0.0557,0.3420,0.001010,0.3110,0.662,173.930,4,167303
2,Sunroof,Nicky Youre,73,Sunroof,44,0.768,0.716,-5.110,1,10,0.0404,0.3500,0.000000,0.1500,0.841,131.430,4,163026
3,Heat Waves,Glass Animals,80,Dreamland (+ Bonus Levels),89,0.761,0.525,-6.900,1,11,0.0944,0.4400,0.000007,0.0921,0.531,80.870,4,238805
4,About Damn Time,Lizzo,81,About Damn Time,92,0.836,0.743,-6.305,0,10,0.0656,0.0995,0.000000,0.3350,0.722,108.966,4,191822

In [9]:
tt22.shape

(263, 18)

In [10]:
tt21['year21'] = True

In [11]:
tt22['year22'] = True

In [12]:
tt21_trat = tt21[['track_name','artist_name', 'year21']]
tt21_trat.head(3)

                               track_name    artist_name  year21
0               STAY (with Justin Bieber)  The Kid LAROI    True
1  Peaches (feat. Daniel Caesar & Giveon)  Justin Bieber    True
2              edamame (feat. Rich Brian)          bbno$    True

In [13]:
tt22_trat = tt22[['track_name','artist_name', 'year22']]
tt22_trat.head(3)

                               track_name   artist_name  year22
0  Running Up That Hill (A Deal With God)     Kate Bush    True
1                               As It Was  Harry Styles    True
2                                 Sunroof   Nicky Youre    True

In [14]:
tt22_trat.merge(tt21_trat, how='left', on=['track_name','artist_name'])

                                 track_name      artist_name  year22 year21
0    Running Up That Hill (A Deal With God)        Kate Bush    True    NaN
1                                 As It Was     Harry Styles    True    NaN
2                                   Sunroof      Nicky Youre    True    NaN
3                                Heat Waves    Glass Animals    True   True
4                           About Damn Time            Lizzo    True    NaN
..                                      ...              ...     ...    ...
258              The Less I Know The Better      Tame Impala    True    NaN
259                              Dandelions          Ruth B.    True   True
260           Jimmy Cooks (feat. 21 Savage)            Drake    True    NaN
261                            Good Looking  Suki Waterhouse    True    NaN
262                                 INFERNO        Sub Urban    True   True

[263 rows x 4 columns]

In [ ]:
tt22_trat.merge(tt21_trat, how='inner', on=['track_name','artist_name'])

,track_name,artist_name,year22,year21
0,Heat Waves,Glass Animals,True,True
1,STAY (with Justin Bieber),The Kid LAROI,True,True
2,abcdefu,GAYLE,True,True
3,MIDDLE OF THE NIGHT,Elley Duhé,True,True
4,INDUSTRY BABY (feat. Jack Harlow),Lil Nas X,True,True
5,TO THE MOON,Jnr Choi,True,True
6,love nwantiti (ah ah ah),CKay,True,True
7,Bad Habits,Ed Sheeran,True,True
8,MONTERO (Call Me By Your Name),Lil Nas X,True,True
9,Build a Bitch,Bella Poarch,True,True
10,SAD GIRLZ LUV MONEY Remix (feat. Kali Uchis an...,Amaarae,True,True
11,THATS WHAT I WANT,Lil Nas X,True,True
12,Life Goes On,Oliver Tree,True,True
13,Dinero,Trinidad Cardona,True,True
14,edamame (feat. Rich Brian),bbno$,True,True
15,Woman,Doja Cat,True,True
16,Leave The Door Open,Bruno Mars,True,True
17,Kiss Me More (feat. SZA),Doja Cat,True,True
18,Beggin',Måneskin,True,True
19,good 4 u,Olivia Rodrigo,True,True
20,Jalebi Baby (Tesher x Jason Derulo),Tesher,True,True
21,Astronaut In The Ocean,Masked Wolf,True,True
22,Need to Know,Doja Cat,True,True
23,MONEY,LISA,True,True
24,Pumped Up Kicks,Madism,True,True
25,Peaches (feat. Daniel Caesar & Giveon),Justin Bieber,True,True
26,positions,Ariana Grande,True,True
27,Bundles (feat. Taylor Girlz),Kayla Nicole,True,True
28,Calling My Phone,Lil Tjay,True,True
29,You Right,Doja Cat,True,True
30,Electric Love,BØRNS,True,True
31,Mood (feat. iann dior),24kGoldn,True,True
32,drivers license,Olivia Rodrigo,True,True
33,The Business,Tiësto,True,True
34,motive (with Doja Cat),Ariana Grande,True,True
35,Good Days,SZA,True,True
36,What You Know Bout Love,Pop Smoke,True,True
37,Savage Love (Laxed - Siren Beat),Jawsh 685,True,True
38,dirty laundry,blackbear,True,True
39,34+35,Ariana Grande,True,True
40,Play Date,Melanie Martinez,True,True
41,Be Kind (with Halsey),Marshmello,True,True
42,Say So,Doja Cat,True,True
43,hot girl bummer,blackbear,True,True
44,Dandelions,Ruth B.,True,True
45,INFERNO,Sub Urban,True,True

In [15]:
tt22_trat.merge(tt21_trat, how='inner', on=['track_name','artist_name'])['track_name'].values

array(['Heat Waves', 'STAY (with Justin Bieber)', 'abcdefu',
       'MIDDLE OF THE NIGHT', 'INDUSTRY BABY (feat. Jack Harlow)',
       'TO THE MOON', 'love nwantiti (ah ah ah)', 'Bad Habits',
       'MONTERO (Call Me By Your Name)', 'Build a Bitch',
       'SAD GIRLZ LUV MONEY Remix (feat. Kali Uchis and Moliy)',
       'THATS WHAT I WANT', 'Life Goes On', 'Dinero',
       'edamame (feat. Rich Brian)', 'Woman', 'Leave The Door Open',
       'Kiss Me More (feat. SZA)', "Beggin'", 'good 4 u',
       'Jalebi Baby (Tesher x Jason Derulo)', 'Astronaut In The Ocean',
       'Need to Know', 'MONEY', 'Pumped Up Kicks',
       'Peaches (feat. Daniel Caesar & Giveon)', 'positions',
       'Bundles (feat. Taylor Girlz)', 'Calling My Phone', 'You Right',
       'Electric Love', 'Mood (feat. iann dior)', 'drivers license',
       'The Business', 'motive (with Doja Cat)', 'Good Days',
       'What You Know Bout Love', 'Savage Love (Laxed - Siren Beat)',
       'dirty laundry', '34+35', 'Play Date', 'Be Kind (with Halsey)',
       'Say So', 'hot girl bummer', 'Dandelions', 'INFERNO'], dtype=object)

### Atividade

**Questão 1 -** Consultar duas base de dados da Netflix para descobrir quais filmes e séries são mais populares no mundo e também no Brasil. Criar repositório público no GitHub com o notebook respostas e compartilhar o link.
*   Lista dos mais populares: https://top10.netflix.com/data/most-popular.xlsx
*   Lista dos mais populares por Países: https://top10.netflix.com/data/all-weeks-countries.xlsx

In [19]:
import pandas as pd

In [26]:
most_popular = pd.read_excel('most-popular.xlsx') #importar dados
# com o link não tava dando certo, acho que por causa do pc da empresa, então fiz download no pessoal e enviei por email, depois baixei

In [25]:
most_popular.head(3) # mostrar 3 linhas da tabela

,category,rank,show_title,season_title,hours_viewed_first_28_days
0,Films (English),1,Red Notice,NaN,364020000
1,Films (English),2,Don't Look Up,NaN,359790000
2,Films (English),3,Bird Box,NaN,282020000

In [27]:
most_popular.tail(3)

,category,rank,show_title,season_title,hours_viewed_first_28_days
37,TV (Non-English),8,Lupin,Lupin: Part 1,316830000
38,TV (Non-English),9,Elite,Elite: Season 3,275300000
39,TV (Non-English),10,Who Killed Sara?,Who Killed Sara?: Season 1,266430000

In [28]:
most_popular.shape

(40, 5)

In [29]:
all_countries = pd.read_excel('all-weeks-countries.xlsx')

In [ ]:
all_countries.head(3)

,country_name,country_iso2,week,category,weekly_rank,show_title,season_title,cumulative_weeks_in_top_10
0,Argentina,AR,2022-09-04,Films,1,Loving Adults,NaN,2
1,Argentina,AR,2022-09-04,Films,2,I Came By,NaN,1
2,Argentina,AR,2022-09-04,Films,3,Me Time,NaN,2

In [33]:
all_countries.tail(3)

,country_name,country_iso2,week,category,weekly_rank,show_title,season_title,cumulative_weeks_in_top_10
117877,Vietnam,VN,2021-07-04,TV,8,Too Hot to Handle,Too Hot to Handle: Season 2,1
117878,Vietnam,VN,2021-07-04,TV,9,Record of Ragnarok,Record of Ragnarok: Season 1,1
117879,Vietnam,VN,2021-07-04,TV,10,Crash Landing on You,Crash Landing on You: Season 1,1

In [32]:
all_countries.shape

(117880, 8)

In [ ]:
all_countries['country_name'].unique()

array(['Argentina', 'Australia', 'Austria', 'Bahamas', 'Bahrain',
       'Bangladesh', 'Belgium', 'Bolivia', 'Brazil', 'Bulgaria', 'Canada',
       'Chile', 'Colombia', 'Costa Rica', 'Croatia', 'Cyprus',
       'Czech Republic', 'Denmark', 'Dominican Republic', 'Ecuador',
       'Egypt', 'El Salvador', 'Estonia', 'Finland', 'France', 'Germany',
       'Greece', 'Guadeloupe', 'Guatemala', 'Honduras', 'Hong Kong',
       'Hungary', 'Iceland', 'India', 'Indonesia', 'Ireland', 'Israel',
       'Italy', 'Jamaica', 'Japan', 'Jordan', 'Kenya', 'Kuwait', 'Latvia',
       'Lebanon', 'Lithuania', 'Luxembourg', 'Malaysia', 'Maldives',
       'Malta', 'Martinique', 'Mauritius', 'Mexico', 'Morocco',
       'Netherlands', 'New Caledonia', 'New Zealand', 'Nicaragua',
       'Nigeria', 'Norway', 'Oman', 'Pakistan', 'Panama', 'Paraguay',
       'Peru', 'Philippines', 'Poland', 'Portugal', 'Qatar', 'Romania',
       'Russia', 'Réunion', 'Saudi Arabia', 'Serbia', 'Singapore',
       'Slovakia', 'Slovenia', 'South Africa', 'South Korea', 'Spain',
       'Sri Lanka', 'Sweden', 'Switzerland', 'Taiwan', 'Thailand',
       'Trinidad and Tobago', 'Turkey', 'Ukraine', 'United Arab Emirates',
       'United Kingdom', 'United States', 'Uruguay', 'Venezuela',
       'Vietnam'], dtype=object)

In [34]:
brazil = all_countries[all_countries['country_name'] == 'Brazil']

In [35]:
brazil.shape

(1260, 8)

In [36]:
most_brazil = brazil.merge(most_popular, how='inner', on='show_title')

In [37]:
most_brazil.shape

(246, 12)

In [ ]:
most_brazil['show_title'].unique()

array(['Extraordinary Attorney Woo', 'Café con aroma de mujer',
       'Purple Hearts', 'Carter', 'The Gray Man', 'Stranger Things',
       'Who Killed Sara?', 'The Takedown', 'Ozark', 'Bridgerton', 'Elite',
       'Black Crab', 'The Adam Project', 'Inventing Anna', 'Restless',
       'Through My Window', 'All of Us Are Dead', "Don't Look Up",
       'The Witcher', 'Money Heist', 'The Unforgivable', 'Red Notice',
       'Squid Game', 'The Forgotten Battle', 'Lucifer', 'Blood Red Sky',
       'Lupin'], dtype=object)

In [38]:
len(most_brazil['show_title'].unique())

27

In [39]:
type(most_brazil['show_title'].unique())

numpy.ndarray

In [40]:
pd.DataFrame(most_brazil['show_title'].unique(), columns=['Populares'])

                     Populares
0                Loving Adults
1   Extraordinary Attorney Woo
2      Café con aroma de mujer
3                Purple Hearts
4                       Carter
5                 The Gray Man
6              Stranger Things
7             Who Killed Sara?
8                 The Takedown
9                        Ozark
10                  Bridgerton
11                       Elite
12                  Black Crab
13            The Adam Project
14              Inventing Anna
15           Through My Window
16          All of Us Are Dead
17               Don't Look Up
18                 The Witcher
19                 Money Heist
20            The Unforgivable
21                  Red Notice
22                  Squid Game
23        The Forgotten Battle
24                     Lucifer
25               Blood Red Sky
26                       Lupin